/*                                 Scrollable Widgets in flutter


SingleChildScrollView : اقدر من خلالها لو معايا صوره كبيره او نص كبير اقدراعمل اسكرول لغايه ما الصوره او النص يخلص يعني بعمل اسكرول لمحتوى واحد فقط

List view : لما بيكون معايا عدد كبير من العناصر في هيئه قائمه بقدر اتنقل ما بين العنصار من خلال الاسكرول 

Grid view : العناصر بتكون على هيئه شبكه مثلا العناصر مقسمه بين عمودين وعدد من الصفوف 

CustomScrollView : لو عايز استخدم اكتر من نوع اسكرول list + grid + appBar متحرك

Scrollbar : الاداه الي بتظهر على جمب الشاشه اقدر منها اعمل اسكرول 



*/ 